{
  "GENERAL": {
    "DIRECTION": "ltr",
    "JOB_TITLE": "Senior Frontend Engineer – Angular Expert",
    "DESCRIPTION": "Willing to relocate",
    "MISCELLANEOUS": "Miscellaneous",
    "SKILLS": "Skills",
    "EDUCATION": "Education",
    "EXPERIENCE": "Experience",
    "PERSONAL_PROJECTS": "Personal Projects",
    "CONTACT": "Contact"
  },
  "HOBBIES": {
    "TITLE": "Hobbies",
    "ELEMENTS": ["Gaming", "Music", "UX/UI Design", "Movies", "Illustration"]
  },
  "CONTACT": {
    "TITLE": "Contact",
    "ELEMENTS": [
      {
        "TITLE": "Email",
        "VALUE": "achraf.abdessalem@gmail.com",
        "LINK": "mailto:achraf.abdessalem@gmail.com"
      },
      {
        "TITLE": "Github",
        "VALUE": "@Achtouf",
        "LINK": "https://github.com/Achtouf"
      },
      {
        "TITLE": "LinkedIn",
        "VALUE": "linkedin.com/in/amachref",
        "LINK": "https://www.linkedin.com/in/amachref/"
      }
    ]
  },
  "INFORMATION": [
    {
      "ANCHORS": "EDUCATION,SKILLS",
      "DESCRIPTION": "A web enthusiast who lives in Lyon. I try to see what is most marvelous in the simplest things. I am creative and have a passionate taste for cinema and music."
    },
    {
      "ANCHORS": "ODIGO_LEAD_FRONTEND_DEVELOPER",
      "DESCRIPTION": "During my experience, I have worked both as a freelancer, for short and long missions, and for a final client. I had the opportunity to develop soft skills, such as demonstrating concentration, rigor, patience and tenacity, which allowed me to work independently, both alone and in a team."
    },
    {
      "ANCHORS": "MOBILE",
      "DESCRIPTION": "In my free time, I enjoy reading articles, watching presentations, and attending meet-ups to keep up to date with different alternatives to the technologies I use every day. I also try to always keep my hand in practicing and using these technologies by creating and updating some personal projects using Supabase, Firebase, Flutter, React, and other frameworks, languages or libraries."
    },
    {
      "ANCHORS": "WEB,DESIGN_SYSTEMS_UI_UX_AND_BRANDING",
      "DESCRIPTION": "As a front-end engineer, I enjoy bridging the gap between engineering and design combining my technical knowledge with my keen eye for design to create a beautiful product. My goal is to always build applications that are scalable and efficient under the hood while providing engaging, pixel-perfect user experiences."
    }
  ],
  "EDUCATION": {
    "ID": "EDUCATION",
    "TITLE": "Education",
    "CONTENT": {
      "MASTER": {
        "ID": "MASTER",
        "TITLE": "Master of Computer Science specialized in Technology of Information",
        "PLACE": "University Lyon 1",
        "DATE": "2019"
      },
      "BACHELOR": {
        "ID": "BACHELOR",
        "TITLE": "Bachelor of Mathematics and Computer Science",
        "PLACE": "University Lyon 1",
        "DATE": "2017"
      }
    }
  },
  "SKILLS": {
    "TITLE": "Skills",
    "CONTENT": {
      "TECHNICAL_SKILLS": {
        "TITLE": "Technical Skills",
        "VALUE": "Angular, NgRX, RXJS, Javascript, Typescript, CSS/SASS, HTML, Schematics, NodeJS, NestJS, UI/UX, Accessibility, Design System."
      },
      "TOOLS": {
        "TITLE": "Tools",
        "VALUE": "NPM, Angular CLI, Lerna, NX, Gulp, Git, GitLab, Jenkins, Nexus, AWS, Visual Studio Code, IntelliJ, Figma, Jira, Confluence."
      },
      "LANGUAGES": {
        "TITLE": "Languages",
        "VALUE": "French, English, Arabic."
      }
    },
    "SOFTWARES": [
      {
        "PERCENT": "65p",
        "TITLE": "Rocket league"
      },
      {
        "PERCENT": "85p",
        "TITLE": "Adobe XD"
      },
      {
        "PERCENT": "75p",
        "TITLE": "Illustrator"
      },
      {
        "PERCENT": "35p",
        "TITLE": "Photoshop"
      },
      {
        "PERCENT": "45p",
        "TITLE": "Figma"
      },
      {
        "PERCENT": "40p",
        "TITLE": "Zeplin"
      },
      {
        "PERCENT": "65p",
        "TITLE": "Procreate"
      }
    ]
  },
  "EXPERIENCE": {
    "ID": "EXPERIENCE",
    "TITLE": "Experience",
    "CONTENT": [
      {
        "ID": "ODIGO_LEAD_FRONTEND_DEVELOPER",
        "TITLE": "Lead Frontend Developer / Senior Frontend Engineer",
        "SUBTITLE": "Odigo",
        "DATE": {
          "FROM": "APRIL 2020",
          "TO": "TODAY"
        },
        "PROJECTS": [
          {
            "ID": "CX_STUDIO",
            "TITLE": "Cx Studio",
            "DESCRIPTION": "Web application to help companies define scenarios on customer journeys for multichannel interactions.",
            "DETAILS": [
              "Enhanced UI/UX using Mosaic and MosaicNG.",
              "Optimized code to improve run and build time and performance.",
              "Improved code quality by implementing ESLint, Prettier, and Stylelint, and adding guidelines and best practices.",
              "Refactored app, wrote solid and reusable components, and form fields."
            ]
          },
          {
            "ID": "MOSAIC",
            "TITLE": "Mosaic",
            "DESCRIPTION": "CSS Framework based on Odigo's Design System.",
            "DETAILS": [
              "Developed a rich, fully customizable, and complete CSS framework using NPM, SASS, and Gulp.",
              "Wrote and deployed documentation to help teams use Mosaic: changelogs and documentation.",
              "Developed a themes builder app that adapts Mosaic to any Design system using Angular, Typescript, and Sass.",
              "Worked closely with the design team on improving components, templates, and building automatically generated color palettes fully accessible.",
              "Improved development, deployment, and contribution processes to make the project inner source."
            ]
          },
          {
            "ID": "MOSAIC_NG",
            "TITLE": "Mosaic NG",
            "DESCRIPTION": "Angular library based on Mosaic and Odigo's Design System.",
            "DETAILS": [
              "Developed generic, performant, documented, and accessible components using Angular, Typescript, NgRx, RXJS.",
              "Wrote and deployed documentation to help teams use MosaicNG: changelogs, migration guide, and documentation.",
              "Improved performance, code quality, and compliance with the UI provided by the design team.",
              "Worked with accessibility experts to make components accessible in all libraries.",
              "Supported worldwide product teams working at Odigo in their usage of Mosaic and Mosaic NG."
            ]
          },
          {
            "ID": "AGENT_DESKTOP",
            "TITLE": "Agent Desktop",
            "DESCRIPTION": "Web application to help agents manage interactions with customers (V6).",
            "DETAILS": [
              "Developed main features and complex components using Angular, Typescript, RXJS, NgRX, NgxTranslate, MosaicNG, and PrimeNG.",
              "Built SDK and Angular libraries providing other teams features and components.",
              "Maintained and deployed multiple NPM libraries and released a new major version with redesigned components following the new brand guidelines and new components.",
              "Adopted and contributed to Odigo's Design System by creating an Angular library.",
              "Helped improve the relationship between Software Engineers and UX/UI Designers.",
              "Designed project using a micro-frontend architecture approach.",
              "Created the project from scratch, adding needed dependencies, and following NFRs, <i aa-glossary=\"Community Of Practice\">CoP</i> decisions, best practices, and common guidelines."
            ]
          },
          {
            "ID": "CAS_AUTHENTICATION_NG",
            "TITLE": "CAS Authentication NG",
            "DESCRIPTION": "Angular library to manage CAS authentication.",
            "DETAILS": [
              "Developed documented services using Angular, Typescript, NgRx, RXJS.",
              "Wrote and deployed documentation to help teams use the library: changelogs, migration guide, and documentation.",
              "Supported worldwide product teams working at Odigo in their usage of CAS Authentication NG."
            ]
          },
          {
            "ID": "QUALIFICATION_CENTER",
            "TITLE": "Qualification Center",
            "DESCRIPTION": "Web application to help NL Experts manage Corpora and Intent Engines.",
            "DETAILS": [
              "Helped the team improve in Front-End by conducting code reviews and setting up pair programming and training sessions.",
              "Developed main features and complex components using Angular, Typescript, RXJS, NgRX, NgxTranslate, and PrimeNG.",
              "Developed Rest APIs using Java and Quarkus.",
              "Created the project from scratch, adding needed dependencies, and following NFRs, <i aa-glossary=\"Community Of Practice\">CoP</i> decisions, best practices, and common guidelines."
            ]
          },
          {
            "ID": "LIFE_AT_ODIGO",
            "TITLE": "Life at Odigo",
            "DETAILS": [
              "Audited multiple projects in an effort to improve technical quality.",
              "Initiated a <i aa-glossary=\"Community Of Practice\">CoP</i> to discuss front-end deployment, development, and best practices concerns.",
              "Created a DEV/UX Community to help improve the relationship between Software Engineers and UX/UI Designers.",
              "Helped create NFRs, guidelines, best practices, and code quality improvements for front-end projects.",
              "Helped create new offers, improve existing offers, and recruit new talent."
            ]
          }
        ]
      },
      {
        "ID": "ODIGO_FRONTEND_DEVELOPER",
        "TITLE": "Frontend Developer",
        "SUBTITLE": "Odigo",
        "DATE": {
          "FROM": "NOV. 2019",
          "TO": "APRIL 2020"
        },
        "PROJECTS": [
          {
            "ID": "CONSOLE",
            "TITLE": "Console",
            "DESCRIPTION": "Web application to help agents manage interactions with customers (V5).",
            "DETAILS": [
              "Developed main features and complex components using Angular, Typescript, RXJS, NgRX, and NgxTranslate.",
              "Improved performance, code quality, and compliance with the UI provided by the design team.",
              "Maintained application in Angular.",
              "Worked alongside an offshore team of engineers in India; provided technical support and optimized and improved front-end application performance."
            ]
          }
        ]
      },
      {
        "ID": "ACENSI_FULLSTACK_DEVELOPER",
        "TITLE": "Fullstack Developer",
        "SUBTITLE": "Acensi - Short Missions",
        "DATE": {
          "FROM": "SEPT. 2018",
          "TO": "DEC. 2022"
        },
        "PROJECTS": [
          {
            "ID": "DGAD",
            "TITLE": "DGAD",
            "DESCRIPTION": "B2B and B2C Web apps to sell Michelin products.",
            "DETAILS": [
              "Developed new features and resolved multiple bugs using VueJS, ApostropheCMS, Nunjucks, MongoDB, SCSS, NodeJS."
            ]
          },
          {
            "ID": "KEEP_COOL",
            "TITLE": "Keep Cool",
            "DESCRIPTION": "Web app to help coaches manage appointments, lessons, and customers.",
            "DETAILS": [
              "Helped make project usable, buildable, and ready to be deployed using Scala, Play, and internal front-end framework."
            ]
          },
          {
            "ID": "FUZE",
            "TITLE": "Fuze",
            "DESCRIPTION": "Web and mobile apps to help Acensi HR department manage and find new candidates.",
            "DETAILS": [
              "Created a web app project from scratch using Angular, Typescript, and NgRX.",
              "Created a mobile app project from scratch using Flutter and Dart.",
              "Developed Rest APIs using NodeJS and Express.",
              "Created CSS frameworks and a simple Design System for Lyon agency's internal apps."
            ]
          },
          {
            "ID": "LIFE_AT_ACENSI",
            "TITLE": "Life at Acensi",
            "DETAILS": [
              "Audited multiple projects in an effort to improve technical quality.",
              "Helped improve existing offers and recruit new talent.",
              "Trained engineers in Front-End technologies.",
              "Animated small talks about new technologies, processes, and best practices.",
              "Participated in making proposals for different clients and projects."
            ]
          }
        ]
      },
      {
        "ID": "E_MAGINEURS_WEB_DEVELOPER",
        "TITLE": "Web Developer",
        "SUBTITLE": "E-magineurs",
        "DATE": {
          "FROM": "Jan. 2017",
          "TO": "July 2017"
        },
        "PROJECTS": [
          {
            "TITLE": "Various Projects",
            "DESCRIPTION": "Websites for cities.",
            "DETAILS": [
              "Developed libraries using JavaScript, Ajax, and Sass.",
              "Created the website using Type3, Typoscript, JavaScript, Sass, jQuery, Ajax, and PHP."
            ]
          }
        ]
      }
    ]
  },
  "PERSONAL_PROJECTS": {
    "ID": "PERSONAL_PROJECTS",
    "TITLE": "Personal Projects",
    "DESCRIPTION": "Most of the projects I have worked on or am still working on are intended for personal use or constitute a training ground with rich context. You can find some examples of these projects here.",
    "CONTENT": [
      {
        "ID": "MOBILE",
        "TITLE": "Mobile",
        "SUBTITLE": "Personal Use",
        "PROJECTS": [
          {
            "ID": "MOBANK",
            "TITLE": "Mobank",
            "SUBTITLE": "Mobile App",
            "COLUMNS": 4,
            "DETAILS": [
              {
                "COLUMN": 4,
                "TEXT": "This app is meant to allow users to have an overview of their budgets in order to make managing their personal projects easier and to have more control over their expenses and incomes. The transactions are set manually to give the user complete control over their data. It is developed using Flutter and Firebase."
              },
              {
                "COLUMN": 1,
                "SRC": "assets/images/png/MOBANK_1.png"
              },
              {
                "COLUMN": 1,
                "SRC": "assets/images/png/MOBANK_2.png"
              },
              {
                "COLUMN": 1,
                "SRC": "assets/images/png/MOBANK_3.png"
              },
              {
                "COLUMN": 1,
                "SRC": "assets/images/png/MOBANK_4.png"
              }
            ]
          },
          {
            "ID": "ENJOY",
            "TITLE": "Enjoy",
            "SUBTITLE": "Mobile App",
            "COLUMNS": 4,
            "DETAILS": [
              {
                "COLUMN": 4,
                "TEXT": "At first designed for businesses, this app enables users to keep track of events organized by their companies and groups they belong to, or to suggest events to their groups. It is developed using Flutter and Firebase."
              },
              {
                "COLUMN": 1,
                "SRC": "assets/images/png/ENJOY_1.png"
              },
              {
                "COLUMN": 1,
                "SRC": "assets/images/png/ENJOY_2.png"
              },
              {
                "COLUMN": 1,
                "SRC": "assets/images/png/ENJOY_3.png"
              },
              {
                "COLUMN": 1,
                "SRC": "assets/images/png/ENJOY_4.png"
              }
            ]
          }
        ]
      },
      {
        "ID": "WEB",
        "TITLE": "Web",
        "SUBTITLE": "Training Background",
        "PROJECTS": [
          {
            "COLUMNS": 4,
            "TITLE": "Wazaaa",
            "SUBTITLE": "Web App",
            "DETAILS": [
              {
                "COLUMN": 1,
                "TEXT": "A clone of Slack, which integrates basic functionalities allowing to test realtime databases, deepen some Angular features, and use Baas platforms like Supabase and Firebase. It is developed using Angular, Supabase, NgRX, RXJS, and NgxTranslate."
              },
              {
                "COLUMN": 3,
                "SRC": "assets/images/png/WAZAAA_1.png"
              }
            ]
          }
        ]
      },
      {
        "ID": "DESIGN_SYSTEMS_UI_UX_AND_BRANDING",
        "TITLE": "Design Systems, UI/UX, and Branding",
        "SUBTITLE": "Design Side",
        "PROJECTS": [
          {
            "COLUMNS": 4,
            "TITLE": "Kiropus",
            "SUBTITLE": "Brand",
            "DETAILS": [
              {
                "COLUMN": 4,
                "TEXT": "This project includes multiple sides; a Branding ideation, a design system and multiple apps."
              },
              {
                "COLUMN": 2,
                "SRC": "assets/images/png/KIROPUS_1.png"
              },
              {
                "COLUMN": 2,
                "SRC": "assets/images/png/KIROPUS_2.png"
              },
              {
                "COLUMN": 2,
                "SRC": "assets/images/png/KIROPUS_3.png"
              },
              {
                "COLUMN": 2,
                "SRC": "assets/images/png/KIROPUS_4.png"
              }
            ]
          },
          {
            "COLUMNS": 4,
            "TITLE": "Kiropus UI",
            "SUBTITLE": "Design System",
            "DETAILS": [
              {
                "COLUMN": 2,
                "TEXT": "A clean design system that I created a few years ago used to create the screens for my mobile apps. It includes rich color palettes, designed components, typography properties, and spacing specifications. The initial project was made on Adobe XD, and Im trying to move it on Figma, update it, and use Design Tokens."
              },
              {
                "COLUMN": 2,
                "SRC": "assets/images/png/KIROPUS_UI_1.png"
              },
              {
                "COLUMN": 2,
                "SRC": "assets/images/png/KIROPUS_UI_2.png"
              },
              {
                "COLUMN": 2,
                "SRC": "assets/images/png/KIROPUS_UI_3.png"
              }
            ]
          }
        ]
      }
    ]
  }
}
